# We be tappin' tappin' tappin'
#======================================================================================================================================
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'nicoverbruggen/homebrew-cask'
tap 'khanhas/tap'

# Binaries
brew 'bash'                                         # Latest Bash version
brew 'coreutils'                                    # Apparently, those that come with macOS are outdated
brew 'ffmpeg'                                       # Convert everything, from Videos to familymembers to .mp3 files
brew 'git'                                          # Git, where'd we be, without it?
brew 'git-flow'                                     # Git, where'd we be, without it? ~~~~~~~~~~
brew 'gnupg'                                        # I hope she hit ya with the pre-gnupg, Drake- never
brew 'grep'                                         # Like google maps but then for your terminal
brew 'httpie'
brew 'hub'                                          # The boring one
brew 'mackup'
brew 'mas'                                          # Mac App Store manager, Mac Apps? Un por queto mas.
brew 'pkg-config'
brew 'svn'
brew 'trash'                                        # Manage the Trash bin
brew 'tree'                                         # List directories in a tree structure
brew 'zlib'                                         # Needed for Memcached
brew 'autoconf'
brew 'gmp'
brew 'gradle'
brew 'ios-deploy'
brew 'ruby'                                         # Edelstenen!
brew 'libzip'                                       # Zip zopperty zop, I just slipped a roofie-drop
brew 'figlet'                                       # HackerMode
brew 'antigen'


# Development
brew 'php'                                          # 8.0.x
brew 'php@7.4'                                      # 7.4.16 Still prefered (for now).
brew 'composer'                                     # 2.0.x
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql', restart_service: true, link: false    # Brew cleanup? Yer gonna have a baad time.
brew 'mariadb', restart_service: true               # Brew cleanup? Yer gonna have a baad time.
brew 'nginx', restart_service: true                 # Brew cleanup? Yer gonna have a baad time.
brew 'dnsmasq', restart_service: true               # Brew cleanup? Yer gonna have a baad time.
brew 'libmemcached'                                 # Considered evil
brew 'memcached'                                    # Considered evil
brew 'neovim'                                       # To impress the ladies
brew 'node'                                         # Packsonpacksonpacksonpacksonpacks skrr, skrrrt, whoo!
brew 'yarn'                                         # Used by the frontend-@Work-homies.
brew 'pnpm'                                         # Now pref, over Yarn

# Apps
#======================================================================================================================================
cask 'appcleaner'                                   # Or Folder-de-shitinizer purgerator9000 as I like to call it
cask 'binance'                                      # You forget, you accidentaly get rich, perfect for ppl like me
cask 'daisydisk'                                    # license@lpass
cask 'expressvpn'                                   # license@lpass
cask 'keka'                                         # Alternative Archive utility c
cask 'aerial'                                       # MacOS
cask 'vlc'


# Music Production / Audio
cask 'ableton-live-suite'                           # Main DAW | Logic for M&M @ the MAS section of this file
cask 'native-access'                                # Manage Native Instruments Software (VST/AU)
cask 'splice'                                       # Sample and project management and synchronisation
cask 'surge-synthesizer'                            # VST/AU (Made by Nerds :) so available through Brew & others)
cask 'spotify'                                      # Music Streaming service
# I'm still butthurt @ nobody made a VST/AU/AAX Package manager yet :( Just imagine... that's currently still a hassle. 

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Msgs
cask 'whatsapp'                                     # Da Homies & Fam
cask 'discord'                                      # Gaming & Communities
cask 'skype'                                        # Does anybody still use this?

cask 'slack'                                        # Da @work-Homies & @work-Fam
cask 'zoom'                                         # Callin' with da @work-Homies

# Productivity
cask 'typora'                                       # MD editor

# Design tools
cask 'sketch'                                       # All round Web-friendly design tool

# Development tools
#======================================================================================================================================

# IDEs
cask 'jetbrains-toolbox'                            # Manage Jetbrains IDE's
# cask 'phpstorm'                                   # manage with jetbrains-toolbox | Day-2-Day weapon of choice
# cask 'android-studio'                             # manage with jetbrains-toolbox
# cask 'rider'                                      # manage with jetbrains-toolbox
# cask 'rubymine'                                   # manage with jetbrains-toolbox
# cask 'webstorm'                                   # manage with jetbrains-toolbox
# cask 'clion'                                      # manage with jetbrains-toolbox
# cask 'AppCode'                                    # manage with jetbrains-toolbox | Xcode, but better, but then again, not realy.

cask 'visual-studio-code'                           # The allround chill editor built on Javascript/Typescript | Day-2-Day quick edits
# cask 'atom'                                       # Your second-choice editor built on Javascript/Javascript

cask 'tinkerwell'                                   # Php/Laravel/Tinker utilities (not rly IDE) #license

# Terminal
cask 'iterm2'                                       # iTerm2=thBest1

# (Local)Host utils
cask 'docker'                                       # Environment containers
cask 'transmit'                                     # FTP client #license
cask 'local'                                        # localwp: I get da front-end-Homies, I don't like it tho

# GUIs
cask 'fork'                                         # Native GIT GUI
cask 'gitkraken'                                    # Chromium (Electron) GIT UI
cask 'tableplus'                                    # Database GUI #license
cask 'insomnia'                                     # Http Client collections/testing
cask 'postman'                                      # Http Client collection/testing

# Utilities
cask 'authy'                                        # 'Authism', is not a disease, it's a blessing
cask 'dropbox'                                      # WHAT'S IN DA BOOOOOOOOX???????!?!?!?!
cask 'transmission'                                 # Send Apple MacOS/iOS apps to testflight

# cask 'alfred'
cask 'google-chrome-canary'                         # Development purposes
cask 'phpmon'                                       # Fi mon ta no demma php version 'ere mon, --seen?

# Mac App Store
mas 'Magnet',   id: 441258766                       # The only thing I miss from my pre-MacOS life
mas 'Numbers',  id: 409203825                       # One of those things you never need, unless when you've just removed it
mas 'iMovie',   id: 408981434                       # I like to put too much effort when making a point @whatsapp, or instagram.
mas 'Logic Pro', id: 634148309			    # Less-chill fr creative process, hawt-damn solid fr mix&mastering w 2many iZotope AU's-DAW
mas 'Transmit 5', id: 1436522307		    # Ftp-Truck filled up with goods.

