# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'nicoverbruggen/homebrew-cask'
tap 'khanhas/tap'

# Binaries
brew 'bash'                         # Latest Bash version
brew 'coreutils'                    # Apparently, those that come with macOS are outdated
brew 'ffmpeg'                       # Convert everything, from Videos to familymembers to .mp3 files
brew 'git'                          # Git, where'd we be, without it?            
brew 'git-flow'                     # Git, where'd we be, without it? ~~~~~~~~~~       
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas'                          # Mac App Store manager
brew 'pkg-config'
brew 'svn'
brew 'trash'                        # Manage the Trash bin
brew 'tree'                         # List directories in a tree structure
brew 'zlib'                         # Needed for Memcached
brew 'autoconf'
brew 'gmp'
brew 'gradle'
brew 'ios-deploy'
brew 'ruby'
brew 'libzip'


# Development
brew 'php'                                          # 8.0.x
brew 'php@7.4'                                      # 7.4.16 Still prefered (for now).
brew 'composer'                                     # 2.0.x
brew 'imagemagick'
brew 'libmemcached'
brew 'meilisearch'
brew 'mysql', restart_service: true, link: false
brew 'mariadb', restart_service: true
brew 'nginx', restart_service: true
brew 'dnsmasq', restart_service: true
brew 'memcached'                                    # Considered evil
brew 'neovim'                                       # To impress the ladies
brew 'node'                                         # Packsonpacksonpacksonpacksonpacks skrr, skrrrt, whoo!
brew 'yarn'                                         # Used by the frontend-@Work-homies.
brew 'pnpm'                                         # Now pref, over Yarn 

# Apps
#======================================================================================
cask 'appcleaner'
cask 'binance'
cask 'daisydisk'    # license
cask 'expressvpn'   # licese
cask 'keka'         # Archiver
cask 'aerial'       # MacOS
cask 'vlc'


# Music Production / Audio
cask 'ableton-live-suite'       # DAW
cask 'native-access'            # Manage Native Instruments Software (VST/AU)
cask 'splice'                   # Sample and project management and synchronisation
cask 'surge-synthesizer'        # VST/AU
cask 'spotify'                  # Music Streaming service

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Msgs
cask 'whatsapp' # Da Homies & Fam
cask 'discord'  # Gaming & Communities
cask 'skype'    # Does anybody still use this?

cask 'slack'    # Da @work-Homies & @work-Fam
cask 'zoom'     # Callin' with da @work-Homies

# Productivity
cask 'typora'   # MD editor

# Development tools
#======================================================================================

# IDEs
cask 'jetbrains-toolbox'    # Manage Jetbrains IDE's
# cask 'phpstorm'           # manage with jetbrains-toolbox | Day-2-Day weapon of choice
# cask 'android-studio'     # manage with jetbrains-toolbox
# cask 'rider'              # manage with jetbrains-toolbox
# cask 'rubymine'           # manage with jetbrains-toolbox
# cask 'webstorm'           # manage with jetbrains-toolbox
# cask 'clion'              # manage with jetbrains-toolbox
# cask 'AppCode'            # manage with jetbrains-toolbox | It's Xcode, but better... but then again, not realy.

cask 'visual-studio-code'   # The allround chill editor built on Javascript/Typescript | Day-2-Day quick editor (for now)
# cask 'atom'               # Your second-choice editor built on Javascript/Javascript

cask 'tinkerwell'           # Php/Laravel/Tinker utilities (not rly IDE) #license

# Terminal
cask 'iterm2'               # iTerm2=thBest1

# Localhost/Environment utils
cask 'docker'               # Environment containers
cask 'transmit'             # FTP client #license
# cask 'local'              # localwp: I get da front-end-Homies, I don't like it tho

# GUIs
cask 'fork'                 # Native GIT GUI
cask 'gitkraken'            # Chromium (Electron) GIT UI
cask 'tableplus'            # Database GUI #license
cask 'insomnia'             # Http Client collections/testing
cask 'postman'              # Http Client collection/testing

# Utilities
cask 'authy'
cask 'dropbox'
cask 'transmission'         # Send Apple MacOS/iOS apps to testflight

# cask 'alfred'
cask 'google-chrome-canary' # Dev purposes
cask 'phpmon'

# Mac App Store
mas 'Magnet', id: 441258766
mas 'Numbers', id: 409203825
