tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "khanhas/tap"
tap "nicoverbruggen/cask"
tap "robotsandpencils/made"
tap "romkatv/powerlevel10k"
tap "shivammathur/php"
cask "ableton-live-suite"
cask "aerial"
cask "alfred"
cask "appcleaner"
cask "authy"
cask "binance"
cask "daisydisk"
cask "dropbox"
cask "elektron-transfer"
cask "expressvpn"
cask "fantastical"
cask "focusrite-control"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-lato"
cask "font-meslo-lg-nerd-font"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "gitkraken"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "keka"
cask "lastpass"
cask "native-access"
cask "paw"
cask "qlmarkdown"
cask "quicklook-json"
cask "raycast"
cask "safari-technology-preview"
cask "sketch"
cask "slack"
cask "splice"
cask "spotify"
cask "surge-synthesizer"
cask "tableplus"
cask "tinkerwell"
cask "transmit"
cask "vlc"
cask "whatsapp"
mas "Developer", id: 640199958
mas "Everhour", id: 1539652800
mas "iA Writer", id: 775737590
mas "LastPass", id: 926036361
mas "Logic Pro", id: 634148309
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Xcode", id: 497799835
